## Pandas

In [5]:
# MATPLOTLIB -> data visualization
# PANDAS -> data analysis
import pandas as pd

### Load dataset

In [6]:
file = pd.read_excel('D://my_worksheet.xlsx')

In [7]:
file

       Name  Salary  Incentive  Reinborement
0  Abdullah   59000      12000          2000
1       Ali   64000       5000          7000
2      Omer   80000        500          4000
3     Usama  110000      15000          3540
4   Huzaifa  150000       3000          3790
5      Saad   45000          0           200

### Access columns

In [14]:
file['Name']

0    Abdullah
1         Ali
2        Omer
3       Usama
4     Huzaifa
5        Saad
Name: Name, dtype: object

In [9]:
file['Salary']

0     59000
1     64000
2     80000
3    110000
4    150000
5     45000
Name: Salary, dtype: int64

In [13]:
file['Incentive'][3]

15000

In [18]:
names = file['Name']
for i in names:
    print(i)

Abdullah
Ali
Omer
Usama
Huzaifa
Saad

### Methods

In [19]:
file.describe()

              Salary     Incentive  Reinborement
count       6.000000      6.000000      6.000000
mean    84666.666667   5916.666667   3421.666667
std     38964.941507   6216.242166   2266.666422
min     45000.000000      0.000000    200.000000
25%     60250.000000   1125.000000   2385.000000
50%     72000.000000   4000.000000   3665.000000
75%    102500.000000  10250.000000   3947.500000
max    150000.000000  15000.000000   7000.000000

In [20]:
# STD = Standard deviation = Data deviated from mean point
# Percentile = data equal to or less than

In [21]:
file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          6 non-null      object
 1   Salary        6 non-null      int64
 2   Incentive     6 non-null      int64
 3   Reinborement  6 non-null      int64
dtypes: int64(3), object(1)
memory usage: 324.0+ bytes

In [25]:
file.columns

Index(['Name', 'Salary', 'Incentive', 'Reinborement'], dtype='object')

### MORE

In [33]:
import numpy as np

name = file['Name']
salary = file['Salary']
inc = file['Incentive']
rb = file['Reinborement']

In [36]:
s = list(salary)

In [37]:
inc = list(inc)

In [38]:
r = list(rb)

In [31]:
# [sum0, sum1, sum2, sum3, sum4]

In [39]:
summm = []
for i in range(6):
    total = s[i] + inc[i] + r[i]
    summm.append(total)

In [40]:
summm

[73000, 76000, 84500, 128540, 156790, 45200]

In [42]:
gross_salary = np.array(s) + np.array(inc) + np.array(r)

In [43]:
file

       Name  Salary  Incentive  Reinborement
0  Abdullah   59000      12000          2000
1       Ali   64000       5000          7000
2      Omer   80000        500          4000
3     Usama  110000      15000          3540
4   Huzaifa  150000       3000          3790
5      Saad   45000          0           200

In [44]:
file['Gross_Salary'] = gross_salary

In [45]:
file

       Name  Salary  Incentive  Reinborement  Gross_Salary
0  Abdullah   59000      12000          2000         73000
1       Ali   64000       5000          7000         76000
2      Omer   80000        500          4000         84500
3     Usama  110000      15000          3540        128540
4   Huzaifa  150000       3000          3790        156790
5      Saad   45000          0           200         45200

In [47]:
file.to_excel('D://updated_file.xlsx')

In [48]:
file.to_csv('D://upd.csv')